<template>
    <div class="user__item">
        <div class="user-avatar">
            <img src="@/assets/img/big-user-avatar.png" alt="" class="user-img">
            <button class="button-icon-secondary user-avatar-btn-wrapper" @click="isActive = !isActive">
                <svg class="user-avatar-btn">
                    <icon></icon>
                </svg>
            </button>
            <div v-show="isActive" class="user-dropDown">
                    <p class="user__drop-down-text">Редактировать</p>
                    <p class="user__drop-down-text">Удалить</p>
            </div>
        </div>
        <div class="user-info">
            <div class="user-title">
                <div class="user-title__wrapper">
                    <h2 class="user-fullname">Котов Семен Васильевич</h2>
                    <p class="user-status">Активен</p>
                </div>
                <button class="button-icon-secondary" @click="isActive = !isActive">
                    <svg class="user-btn">
                        <icon></icon>
                    </svg>
                </button>
                <div v-show="isActive" class="user-title-dropDown">
                    <p class="user-title__drop-down-text">Редактировать</p>
                    <p class="user-title__drop-down-text">Изменить пароль</p>
                    <p class="user-title__drop-down-text">Просмотр задач пользователя </p>
                    <p class="user-title__drop-down-text">Удалить </p>
                </div>
            </div>
            <div class="user-about">
                <p class="user-about-subtitle">О себе:</p>
                <p class="user-about-text">Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики. Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку. Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу. Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка. Грустный риторический вопрос скатился по его щеке и он продолжил свой путь. По дороге встретил текст рукопись. Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну». Не послушавшись рукописи, наш текст продолжил свой путь. Вскоре ему повстречался коварный составитель рекламных текстов, напоивший его языком и речью и заманивший в свое агенство, которое использовало его снова и снова в своих проектах. И если его не переписали, то живет он там до сих пор. Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка р.</p>
            </div>
        </div>
    </div>
</template>

<script>
import icon from "@/components/icon.vue";
export default {
    name: "user-profile",
    components: {
        icon,
    },
    data(){
        return{
            isActive: false,
        }
    }
}
</script>

<style lang="scss">
@import "@/styles/components/user-profile.scss";
</style>